name: "ensemble_model_english"
platform: "ensemble"
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1 ]
  },
  {
    name: "postnet_output"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1 ]
  },
  {
    name: "p_predictions"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  },
  {
    name: "e_predictions"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  },
  {
    name: "log_d_predictions"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  },
  {
    name: "d_rounded"
    data_type: TYPE_FP32
    dims: [ 1, -1 ]
  },
  {
    name: "src_masks"
    data_type: TYPE_BOOL
    dims: [ 1, -1 ]
  },
  {
    name: "mel_masks"
    data_type: TYPE_BOOL
    dims: [ 1, -1 ]
  },
  {
    name: "src_lens"
    data_type: TYPE_INT64
    dims: [ 1 ]
  },
  {
    name: "mel_lens"
    data_type: TYPE_INT64
    dims: [ 1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess_english"
      model_version: -1
      input_map {
        key: "text"
        value: "text"
      }
      output_map {
        key: "speakers"
        value: "speakers"
      }
      output_map {
        key: "texts"
        value: "texts"
      }
      output_map {
        key: "text_lens"
        value: "text_lens"
      }
      output_map {
        key: "max_text_lens"
        value: "max_text_lens"
      }
    },
    {
      model_name: "fast-speech-2"
      model_version: -1
      input_map {
        key: "speakers"
        value: "speakers"
      }
      input_map {
        key: "texts"
        value: "texts"
      }
      input_map {
        key: "text_lens"
        value: "text_lens"
      }
      input_map {
        key: "max_text_lens"
        value: "max_text_lens"
      }
      output_map {
        key: "output"
        value: "output"
      }
      output_map {
        key: "postnet_output"
        value: "postnet_output"
      }
      output_map {
        key: "p_predictions"
        value: "p_predictions"
      }
      output_map {
        key: "e_predictions"
        value: "e_predictions"
      }
      output_map {
        key: "log_d_predictions"
        value: "log_d_predictions"
      }
      output_map {
        key: "d_rounded"
        value: "d_rounded"
      }
      output_map {
        key: "src_masks"
        value: "src_masks"
      }
      output_map {
        key: "mel_masks"
        value: "mel_masks"
      }
      output_map {
        key: "src_lens"
        value: "src_lens"
      }
      output_map {
        key: "mel_lens"
        value: "mel_lens"
      }
    }
  ]
}
