name: "ensemble_model_english"
platform: "ensemble"
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "wav_predictions"
    data_type: TYPE_INT16
    dims: [ -1, -1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocess_english"
      model_version: -1
      input_map {
        key: "text"
        value: "text"
      }
      output_map {
        key: "speakers"
        value: "speakers"
      }
      output_map {
        key: "texts"
        value: "texts"
      }
      output_map {
        key: "text_lens"
        value: "text_lens"
      }
      output_map {
        key: "max_text_lens"
        value: "max_text_lens"
      }
    },
    {
      model_name: "fast-speech-2"
      model_version: -1
      input_map {
        key: "speakers"
        value: "speakers"
      }
      input_map {
        key: "texts"
        value: "texts"
      }
      input_map {
        key: "text_lens"
        value: "text_lens"
      }
      input_map {
        key: "max_text_lens"
        value: "max_text_lens"
      }
      output_map {
        key: "postnet_output"
        value: "postnet_output"
      }
      output_map {
        key: "mel_lens"
        value: "mel_lens"
      }
    },
    {
      model_name: "synth_sample"
      model_version: -1
      input_map {
        key: "postnet_output"
        value: "postnet_output"
      }
      input_map {
        key: "mel_lens"
        value: "mel_lens"
      }
      output_map {
        key: "wav_predictions"
        value: "wav_predictions"
      }
    }
  ]
}
