backend: "python"
input [
    {
        name: "postnet_output"
        data_type: TYPE_FP32
        dims: [ 1, -1, -1 ]
    },
    {
        name: "mel_lens"
        data_type: TYPE_INT64
        dims: [1]
    }
]
output [
    {
        name: "wav_predictions"
        data_type: TYPE_INT16
        dims: [ -1, -1 ]
    }
]
